export default {
	title: "CMSX",
	tagline: "康奈尔大学计算机科学系所使用的课程管理网站。",
	date: "2020 年 1 月 - 2020 年 12 月",
	content: `
在 2020 年期间，我作为志愿者加入了专注于提升康奈尔大学的 Course Management System X (CMSX) 的项目团队。该系统被计算机科学和信息科学部门的学生和教师广泛用于包括作业、测验和调查在内的学术任务中。值得注意的是，它支持与自动评分系统、剽窃检测工具和课程管理工具的集成。

然而，由于该系统已运行超过二十年，其用户界面开始显现出过时的迹象。学生和教师均反映其美学设计过时，更重要的是，由于其最初的设计规范，该平台不适合在移动设备上使用。因此，我与前端部门合作，进行了整个前端的全面重设计，特别强调了响应式设计。为了实现快速和现代化的开发过程，我们选择使用 React 和 Redux。

我的职责包括开发多个用户界面组件。在设计过程中，我在移动设备上严格测试每个迭代版本，以确保最佳功能。此外，我还与部门成员进行可用性测试，获取宝贵的反馈，以增强网站的直观性。

在 2020 年秋季学期完成前端重设计后，我们开始向部门分阶段发布新版前端。我们收到了压倒性的积极反馈，称赞重新设计的前端增强了直观性和易用性。该项目的影响至今仍然显而易见。

遗憾的是，由于项目的性质，源代码不予公开。
`,
};
