export default {
	title: "Circolo.us",
	tagline: "使用 React 进行全面的网站改造，并实现电子商务功能。",
	date: "2022 年 6 月 - 2022 年 8 月",
	content: `
在 2022 年的暑期实习期间，我有幸加入了 Circolo，这是一家位于旧金山的创新初创公司，专注于生产智能健身镜。作为一名前端开发人员，我的主要职责是重构和部署公司的网站，该网站之前托管在 Shopify 上，并使用自定义主题。不幸的是，这个版本的网站存在性能问题和严重的定制限制，这些问题成为进一步发展的重大障碍。

为了解决这些问题，我们决定采用 React 构建一个全新改造的前端。我们选择使用这个备受推崇的框架是因为它具有完全控制的能力，并且拥有一个强大的库生态系统，有利于快速高效的开发。在不到一个月的时间内，我成功地从头开始重建了整个网站，同时确保与 Shopify API 的兼容性。这一成就保证了我们的客户可以继续无缝地购买我们的产品。此外，我还提高了 PageSpeed 分数，使网站更加响应，并实施了搜索引擎优化技术，以提高网站在各大搜索引擎上的可见度。

网站完成后，我的注意力转向了实现持续集成和持续部署（CI/CD）管道以及解决部署问题。我们选择使用 Cloudflare workers 来托管网站，并结合 Amazon S3 来简化静态资产的管理。我准备了适合生产环境的代码库，利用GitHub Actions进行生产和预览部署的自动化部署。这种方法使未来的开发人员能够在合并到主代码库之前，在类似生产的环境中预览他们的分支。最后，我协助主管在停机时间最少的情况下启动了新的生产网站，确保对客户的影响最小。

请注意，由于项目的商业性质，源代码不可公开访问。您可以访问 [circolo.us](https://circolo.us) 查看该网站。
`,
};
