export default {
	title: "Circolo.us",
	tagline: "使用 React 进行全面的网站改造，并实现电子商务功能。",
	date: "2022 年 6 月 - 2022 年 8 月",
	content: `
2022 年暑期实习期间，我加入了 Circolo——一家位于旧金山的创新初创公司，专注于智能健身镜的研发。作为前端开发，我主要负责重构并部署公司官网。该网站此前托管在 Shopify 上，使用自定义主题，但存在性能问题和严重的定制限制，阻碍了进一步发展。

为解决这些问题，我们决定用 React 完全重构前端。选择 React 是因为它能提供完全的控制权，并拥有丰富的库生态，便于快速高效开发。不到一个月，我从零开始重建了整个网站，同时保持了与 Shopify API 的兼容，确保客户可以无缝购买产品。此外，我还提升了 PageSpeed 分数，优化了响应速度，并实施了 SEO 技术以提高搜索引擎可见度。

网站完成后，我开始搭建 CI/CD 流程并解决部署问题。我们使用 Cloudflare Workers 托管网站，配合 Amazon S3 管理静态资源。我配置了生产环境代码库，利用 GitHub Actions 实现生产和预览环境的自动化部署，让开发人员可以在合并主分支前在类生产环境中预览。最后，我协助主管以最小停机时间上线新网站，将对客户的影响降到最低。

新网站显著改善了用户体验和性能，实现了流畅的电商运营和更好的客户互动。遗憾的是，Circolo 已停止运营，网站已无法访问。

由于项目的商业性质，源代码不对外公开。
`,
};
