import { WINDOWS, MACOS, GITHUB } from "./en";

export default {
	title: "Fallen Flame",
	tagline: "用 Java 写成的多平台桌面端游戏。",
	date: "2020 年 1 月 - 2020 年 5 月",
	pdfName: "游戏说明",
	content: `
作为康奈尔大学的游戏设计项目 (Game Design Initiative at Cornell University, GDIAC) 课程中的一个重要组成部分，我参与了一个由八名成员组成的团队，开发了一款名为 Fallen Flame 的跨平台桌面游戏。我们的团队分为两个专业子团队：一个专注于编程，另一个专注于艺术。作为编程子团队的一员，我的职责包括创建核心游戏控制器、实现各种游戏内模型，以及管理声音和输入子系统。

该游戏使用 Java 编程语言，并由 LibGDX 框架支持。与使用 Unity 等现成的商业游戏引擎不同，我们选择精心制作项目的多个方面。这包括设计和实现一个输入处理系统、一个声音系统和一个粒子系统。该项目使我在视频游戏开发的关键组件方面获得了宝贵的经验。

除了游戏实现的技术方面，我和我的同事们从头开始设计了我们游戏的整个框架，并特别强调了游戏性。这表明该项目不仅仅是一个技术项目，还是一个设计项目。通过这个过程，我们在如何制作一个优化玩家享受的游戏方面获得了大量见解。我们的最终产品展示了我们所获得的知识。

总而言之，我们创造了一个见证我们奉献和辛勤工作的产品。最终输出（可在 [Windows](${WINDOWS}) 和 [macOS](${MACOS}) 上使用）以及相关的代码库可在 [GitHub](//github.com/${GITHUB}) 上公开访问。这个项目是我游戏设计辅修学位的一部分。
`,
};
