export default {
	title: "Aang 虚拟形象助手",
	tagline: "可自定义形象的 AI 助手平台。",
	date: "2024 年 08 月 2024 年 11 月",
	content: `
Aang 是一款为 Circolo 自助终端设计的强大 AI 助手系统，基于 ChatGPT 和 HeyGen 技术构建。它允许客户创建个性化的虚拟形象和定制提示，提供一种互动体验，客户可以简单地走到终端前向他们选择的虚拟形象提问。系统提供了流畅、直观的互动体验，感觉自然且引人入胜。

Aang 的真正优势在于其高度的定制化。客户只需录制一个简短的 2 分钟视频，就能让团队成员的活力和个性通过虚拟形象展现出来，为客户提供真实生动的互动体验，而非一般的动画或机器人交互。

该项目最近一个显著的应用是在一家附近的医院，医生和医护人员作为多个终端上的虚拟形象提供服务。在这里，Aang 协助进行基本的分诊并解答小型健康问题，得到了患者和相关方的积极反馈。尽管项目源代码不对外公开，但有一个 [演示](https://avatar.circolo.us/go) 可供公众体验其功能。
`,
};
